'''
def myRandom(x):
    x = (7 * x)
'''
'''
def FindSymbol(s, n):
    for i in n:
        if s in i:
            return True
    return False

lst = ["Привет", "234"]
print (FindSymbol("2", lst))
'''
'''
Задача 21
Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
Пример:
список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
список: [], ищем: "123", ответ: -1
'''
s = "qwe"
c = int(0)
lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
for item in lst:
    while c < 3:
        if s == item:
            c = c + 1
            pos = item.
print(pos)



